Repository: 2silver/collective.behavior.seo
Catalog: src/collective/behavior/seo/locales/*/LC_MESSAGES/collective.behavior.seo.po
Languages: de

source: Collective Behavior SEO settings
de: Collective Behavior SEO instellingen

source: SEO Description
de: SEO Beschreibung - "Meta Description"

source: SEO Title
de: SEO Titel - "Meta Title"

source: This content is maybe outdated.
de: Dieser Inhalt ist möglicherweise veraltet.

source: This could be more relevant content.
de: Dies könnte relevanterer Inhalt sein.

source: label_seo_outdated
de: Veralteter Inhalt

source: label_seo_outdated_alternate
de: Alternativer Inhalt

source: robot_tags_desc
de: Kombination von Robot-Tags eingeben, durch Kommas getrennt, eine Kombination pro Zeile. Die Idee ist, dass der Webmaster entscheidet, welche Kombinationen von mehreren Tags sinnvoll sind, damit die Inhaltseditoren keine logischen Kombinationen aus allen einzelnen Tags selbst erstellen müssen.

source: seo_description_help
de: Länge für Description mit SERP Snippet Tool ermitteln. Wir empfehlen, "SERP Snippet Generator" zu googeln.

source: seo_outdated_alternate_help
de: Alternative URL für veralteten Inhalt. Möglicherweise eine neue Version des Inhalts.

source: seo_outdated_help
de: Aktivieren, wenn der Inhalt veraltet ist und als "Alter Inhalt" für Besucher und SEO (410 Gone) markiert werden soll.

source: seo_robots_help
de: Kies opties die zoekmachines oppikken voor het gebruik van deze inhoud. Normaal gezien zijn lijsten bedoeld om door de site te navigeren, maar voegen ze weinig eigen waarde toe, en zouden op 'noindex, follow' gezet moeten worden. In sommige gevallen wil je dat een lijst wel geïndexeerd wordt. Bijvoorbeeld wanneer je een Top 10 van recepten hebt met extra inhoud onder en boven de lijst. In dat geval gebruik je 'index,follow'.

source: seo_title_help
de: Länge für Title mit SERP Snippet Tool ermitteln. Wir empfehlen, "SERP Snippet Generator" zu googeln.
